00test/oldtest/Laser_3D_buse_turb_escape/0/epsilon.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.05;
    }

    powderInlet
    {
        type            fixedValue;
        value           uniform 0.2;
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.05;
        value           uniform 0.05;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
